toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskImg")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

struct _TaskMain {
    static void Start() {
        _Scheduler::Start<_TaskMain>();
    }
    
    static void Reset() {
        // Reset our state
        _Power = {};
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Init();
        _TaskImg::Init();
        // Stop tasks
        _Scheduler::Stop<_TaskSD>();
        _Scheduler::Stop<_TaskImg>();
        _Scheduler::Stop<_TaskMain>();
        // Turn off power
        _VDDIMGSDSet(false);
        _VDDBSet(false);
    }
    
    static void _TimeTrigger(_Events::Event& ev) {
        _CaptureStart(ev.timeTrigger().captureEvent);
    }
    
    static void _CaptureImage(_Events::Event& ev) {
        constexpr MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
        // Turn on VDD_B power (turns on ICE40)
        _VDDBSet(true);
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms(30));
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _VDDIMGSDSet(true);
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait for _TaskSD to be initialized and done with writing, which is necessary
            // for 2 reasons:
            //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
            //      access it,
            //   2. we can't initiate a new capture until writing to the SD card (from a
            //      previous capture) is complete (because the SDRAM is single-port, so
            //      we can only read or write at one time)
            _TaskSD::WaitForInitAndWrite();
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
//            for (;;) {
//                // Capture an image
//                {
//                    // Wait for _TaskSD to be initialized and done with writing, which is necessary
//                    // for 2 reasons:
//                    //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
//                    //      access it,
//                    //   2. we can't initiate a new capture until writing to the SD card (from a
//                    //      previous capture) is complete (because the SDRAM is single-port, so
//                    //      we can only read or write at one time)
//                    _TaskSD::WaitForInitAndWrite();
//                    
//                    // Capture image to RAM
//                    _TaskImg::Capture(imgRingBuf.buf.id);
//                    const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
//                    
//                    // Copy image from RAM -> SD card
//                    _TaskSD::Write(srcRAMBlock);
//                    _TaskSD::Wait();
//                }
//                
//                break;
//                
////                // Wait up to 1s for further motion
////                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
////                if (!motion) break;
////                
////                // Only reset _Motion if we've observed motion; otherwise, if we always reset
////                // _Motion, there'd be a race window where we could first observe
////                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
////                // the true value by resetting it to false.
////                _Motion = false;
//            }
//        
//        if (trigger & _TriggerSources::Manual) {
//            _LEDRed_::Set(_LEDPriority::Capture, 1);
//        }
        
        _VDDIMGSDSet(false);
        _VDDBSet(false);
        
        _Events::Capture& capture = ev.capture();
        capture.countRem--;
        if (capture.countRem) {
            _EventInsertDelayed(ev, capture.base().delayMs);
        }
    }
    
    static void _MotionEnable(_Events::Event& ev) {
        _Events::MotionTrigger& motion = ev.motionTrigger();
        motion.enabled.acquire();
    }
    
    static void _MotionDisable(_Events::Event& ev) {
        _Events::MotionTrigger& motion = ev.motionTrigger();
        motion.enabled.release();
    }
    
    static void _MotionUnsuppress(_Events::Event& ev) {
        _Events::MotionTrigger& motion = ev.motionTrigger();
        motion.enabled.suppress(false);
    }
    
    static void Run() {
//        for (bool x=false;; x=!x) {
//            _Pin::LED_RED_::Write(x);
//            _BatterySampler::Sample();
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
//        // Handle cold starts
//        if (!_FirstRunDone) {
//            _FirstRunDone = true;
//            // Since this is a cold start, delay 3s before beginning.
//            // This delay is meant for the case where we restarted due to an abort, and
//            // serves 2 purposes:
//            //   1. it rate-limits aborts, in case there's a persistent issue
//            //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//            _LEDRed_::Set(_LEDRed_::Priority::Low, 0);
//            _Scheduler::Sleep(_Scheduler::Ms(3000));
//            _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
//        }
//        
//        _Scheduler::Sleep(_Scheduler::Ms(10000));
        
